In [1]:
import numpy as np
import pandas as pd

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

#Bazı veriler boş olduğunda(Missing Data) yapılması gerekenler anlatılıyor. (np.nan boş demek.)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

### 1- Olmayan verileri komple silebiliriz.

In [5]:
havaDurumuDataFrame.dropna()

#dropna metodu, varsayılan olarak bir satırda NaN değeri varsa satırı komple siler.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

#Bilindiği üzere Data Framemimiz hala değişmedi.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
havaDurumuDataFrame.dropna(axis = 1)

#Sütun olarak NaN olanları sil dersek dropna içerisine axis = 1 yazmamız gerekiyor.

   Izmir
0     40
1     39
2     38

In [8]:
#Fakat 1 tane NaN var diye satırı veya sütunu komple silmek mantıklı değil.
#Fazlaca NaN varsa silmek mantıklı olur.

In [9]:
yeniVeri = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [10]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [11]:
yeniDataFrame.dropna(axis = 1, thresh = 2)

#thresh argümanı 2 ve üzeri olan NaN'ları kaldır demek. (sütundan kaldırmak istediğimiz için axis = 1 yazdık.)
#Bu veri için satırlarda 2 NaN olanları kaldırsaydık 1 ve 2'de 2 tane NaN olduğu için tek 0 satırı kalacaktı.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

### 2- Olmayan verilerimize ortalama değer atayabiliriz.

In [12]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [13]:
yeniDataFrame.fillna(20)

#fillna metodu boş olan verileri içerisinde yazılan değer ile doldur demek.

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [14]:
#Satırları gruplamaya yarar.
#MultiIndex yapısı gibidir fakat herhangi bir multi index olmadan da kolondan(sütundan) gruplama yapılabilir.

In [18]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan İsmi" : ["Ahmet","Mehmet","Atıl","Burak","Zeynep","Fatma"],
                "Maas" : [100,150,200,300,400,500]
              }

In [19]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [20]:
maasDataFrame

   Departman Calisan İsmi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [21]:
#Departmana göre gruplama yapmaya çalışalım.

In [22]:
maasDataFrame.groupby("Departman")

In [ ]:
#RAM'e kaydedildi dedi.
#Departmana göre gruplama yaptık fakat biz bununla ilgili işlemler yapabilmemiz için bir değişkene eşitlememiz gerekiyor.

In [23]:
grupObjesi = maasDataFrame.groupby("Departman")

In [24]:
grupObjesi.count()

           Calisan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [25]:
grupObjesi.mean()

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazılım     125

In [26]:
grupObjesi.min()

          Calisan İsmi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atıl   200
Yazılım          Ahmet   100

In [27]:
grupObjesi.max()

          Calisan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [28]:
grupObjesi.describe()

#Verilerimiz ile ilgili genel sonuçları verir. (ortalama, sapma, medyan vs.) (Güzel Metod !!)

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0